Documents/Д_ЗаявкаНаИзменениеУсловийКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Д_ЗаявкаНаИзменениеУсловийКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текстовка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВсем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступнаПользователям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рецензенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияКлиента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекОтсрочка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекВерх</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийЛимитДЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийЛимитПДЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекМаксКоличествоДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяМесячнаяПотребность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отсрочка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предоплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Верх</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛимитДЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛимитПДЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксКоличествоДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесячнаяПотребность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекПредоплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСпирта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекТипСпирта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекЕдИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоговоренностиКлиента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Верх</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекВерх</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КтоОтдает</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Д_ЗаявкаНаИзменениеУсловийКлиента/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка, РецензентКомментарий = Неопределено, МассивОткрытыхИсторий = Неопределено, МассивОткрытыхИсторийАвтора = Неопределено) Экспорт
		
	Макет = Документы.Д_СлужебнаяЗаписка.ПолучитьМакет("Печать");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	// статус
	ОбластьШапкаСтатус = Макет.ПолучитьОбласть("ШапкаСтатус");
	ОбластьТекстовка = Макет.ПолучитьОбласть("Текстовка");
	ОбластьШапкаЗаг = Макет.ПолучитьОбласть("ШтампыЗаголовок");
	ОбластьШтампы = Макет.ПолучитьОбласть("Штампы");
	ОбластьСогласование = Макет.ПолучитьОбласть("ШапкаСогласование");
	ОбластьОзнакомлениеШапка = Макет.ПолучитьОбласть("ШапкаОзнакомление");
	ОбластьОзнакомление = Макет.ПолучитьОбласть("ШтампыОзнакомление");
	ОбластьПрикрепление = Макет.ПолучитьОбласть("Прикрепление");
	ОбластьПустыеСтроки = Макет.ПолучитьОбласть("ПустыеСтроки");
	ОбластьИнициатор = Макет.ПолучитьОбласть("ШтампыИнициатор");
	ОбластьОтступ = Макет.ПолучитьОбласть("ОтступСтрока|ОтступСтолбец");
	ОбластьЛимитДЗ = Макет.ПолучитьОбласть("ЛимитДЗ");
	ОбластьЛимитДЗ1 = Макет.ПолучитьОбласть("ЛимитДЗ1");
	ОбластьЛимитДЗ2 = Макет.ПолучитьОбласть("ЛимитДЗ2");
	ОбластьЛимитДЗ3 = Макет.ПолучитьОбласть("ЛимитДЗ3");
	ОбластьЛимитДЗ4 = Макет.ПолучитьОбласть("ЛимитДЗ4");
	//ОбластьКомандировка = Макет.ПолучитьОбласть("ЗаявкаНаКомандировку");
	
	ОбластьСтроительство = Макет.ПолучитьОбласть("ШапкаСтроительство");
	
	Предприятия = Новый Массив;
	МассивСтатей = Новый Массив;
	
	ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь;
	
	//////////////////////////вывод СЗ на печать
	
	ИтогоСебестоимость1 = 0; ИтогоБДДС1 = 0;
	ИтогоСебестоимость2 = 0; ИтогоБДДС2 = 0;
	ИтогоСебестоимостьОткл = 0; ИтогоБДДСОткл = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	Документ.Д_ЗаявкаНаИзменениеУсловийКлиента КАК Д_ЗаявкаНаИзменениеУсловийКлиента
	|ГДЕ
	|	Д_ЗаявкаНаИзменениеУсловийКлиента.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	//получаем прикрепленные объекты
	ВыборкаПоФайлам = БПСервер.ПолучитьПрикрепленныеОбъектыДляПечати(Ссылка);
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.СогласованиеДоговораСтроительство Тогда
			
			ОбластьСтроительство.Параметры.Ссылка 				= Выборка.Ссылка;
			ОбластьСтроительство.Параметры.НаименованиеДоговора	= Выборка.НаименованиеДоговора;
			ОбластьСтроительство.Параметры.НомерСтр 			= Выборка.НомерДоговора;
			ОбластьСтроительство.Параметры.ЧислоСтр 			= Формат(Выборка.ДатаДоговора, "ДФ=dd");
			ОбластьСтроительство.Параметры.МесяцСтр 			= Формат(Выборка.ДатаДоговора, "ДФ=ММММ");
			ОбластьСтроительство.Параметры.ГодСтр 				= Формат(Выборка.ДатаДоговора, "ДФ=гггг");
			ОбластьСтроительство.Параметры.КонтрагентСтр 		= Выборка.Контрагент;
			ОбластьСтроительство.Параметры.ЮрЛицоСтр 			= Выборка.ЮрЛицоКомпании;
			ОбластьСтроительство.Параметры.ПредметДоговораСтр 	= Выборка.Текстовка;
			ОбластьСтроительство.Параметры.ЦФОСтр 				= Выборка.СтрЦФО;
			ОбластьСтроительство.Параметры.КомментарийСтр 		= Выборка.Комментарий;
			ОбластьСтроительство.Параметры.ПроектСтр 			= Выборка.Предприятие;
			ОбластьСтроительство.Параметры.СтатьяДДССтр 		= Выборка.СтатьяБДДС;
			ОбластьСтроительство.Параметры.ОбъектСтр			= Выборка.Объект;
			ТабДок.Вывести(ОбластьСтроительство);
			
			Пока ВыборкаПоФайлам.Следующий() Цикл 
				ОбластьПрикрепление.Параметры.Вложение = Строка(ВыборкаПоФайлам.Файл);
				ОбластьПрикрепление.Параметры.РасшифровкаВложение = Новый Структура("Файл", ВыборкаПоФайлам.Файл);
				ТабДок.Вывести(ОбластьПрикрепление);
			КонецЦикла;	
			
		Иначе
			//Если Выборка.ЦФОвТЧ Тогда
			СуфиксЦФО = "ЦФО";
			//Иначе
			//	СуфиксЦФО = "";		
			//КонецЕсли;
			
			ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ" + СуфиксЦФО);
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал" + СуфиксЦФО);
						
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			Если Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.Приказ Тогда
				ОбластьЗаголовок.Параметры.Ссылка = "Приказ " + Прав(Выборка.Ссылка, 34);
			Иначе	
				ОбластьЗаголовок.Параметры.Ссылка = Выборка.Ссылка;
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			ОбластьШапка.Параметры.Дата = Выборка.Дата;
			ОбластьШапка.Параметры.Комментарий = Выборка.Комментарий;
			ОбластьШапка.Параметры.ВидСЗ = ?(Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.ЗаявкаНаКадровоеДвижение, "" + Выборка.ВидСЗ + " (" + Выборка.ВидКадровогоДвижения + ")", Выборка.ВидСЗ);
			// имя пользователя и должность
			ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, ?(ПустаяСтрока(Выборка.Автор), Выборка.Предприятие.Финансист, Выборка.Автор));
			ОбластьШапка.Параметры.ОтКого = ?(ЗначениеЗаполнено(ИмяДолжность.ПредставлениеПользователя), ИмяДолжность.ПредставлениеПользователя + " ", "") + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), ИмяДолжность.Должность, "");	
			
			// закомментированно 01.03.13 строка
			//ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, Выборка.Кому);
			//ОбластьШапка.Параметры.Кому = ?(ПустаяСтрока(Выборка.Кому), "ДКФ", Строка(ИмяДолжность.ПредставлениеПользователя) + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), " " + "(" + Строка(ИмяДолжность.Должность) + ")", ""));
			
			СтрокаКому = "";		
			Для ИндСтр = 0 По Выборка.Ссылка.Рецензенты.Количество() - 1 Цикл
				
				ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(Выборка.Дата, Выборка.Ссылка.Рецензенты[ИндСтр].Пользователь);
				СтрокаКому = СтрокаКому + Строка(ИмяДолжность.ПредставлениеПользователя) + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), " " + ИмяДолжность.Должность, "") + ?(ИндСтр <> Выборка.Ссылка.Рецензенты.Количество() - 1, "; ", ""); 
				
			КонецЦикла;
			
			ОбластьШапка.Параметры.Кому = ?(ПустаяСтрока(Выборка.Кому), "ДКФ", СтрокаКому);
			
			ОбластьШапка.Параметры.ЦФО = Строка(Выборка.Предприятие) + ?(Выборка.Предприятие.УчетПоПодразделениям, " (" + Строка(Выборка.Подразделение) + ")", "");
			
			ТабДок.Вывести(ОбластьШапка);
			
			// статус 
			ОбластьШапкаСтатус.Параметры.ТекущийСтатус = БПСервер.ПолучитьТекущуюТочкуМаршрута(Ссылка);
			Если Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.Приказ Тогда
				ОбластьШапкаСтатус.Параметры.Действующий = "(" +Строка(?(Выборка.НеДействующий, "Не действующий", "Действующий"))+")";
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьШапкаСтатус);
			
			//Если Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.ЗаявкаНаКомандировочные Тогда
			//	ЗаполнитьЗначенияСвойств(ОбластьКомандировка.Параметры, Выборка);
			//	ТабДок.Вывести(ОбластьКомандировка);
			//КонецЕсли;	
			
			Пока ВыборкаПоФайлам.Следующий() Цикл 
				ОбластьПрикрепление.Параметры.Вложение = Строка(ВыборкаПоФайлам.Файл);
				ОбластьПрикрепление.Параметры.РасшифровкаВложение = Новый Структура("Файл", ВыборкаПоФайлам.Файл);
				ТабДок.Вывести(ОбластьПрикрепление);
			КонецЦикла;	
			//Иначе
			//	ТабДок.Вывести(ОбластьПустыеСтроки);
			//КонецЕсли;
			
			СтруктураПоиска = Новый Структура("Заявка", Выборка);
			
			
			//вывод для лимитов
			//Если Выборка.ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.СогласованиеУсловийКлиента Тогда
			//	
			//	//ЗначенияЛимитов = РасчитатьЛимиты(Предприятия, МассивСтатей, Выборка);	
			//	ТЗ = Выборка.УсловияКлиента.Выгрузить();
			//	
			//	Для каждого ТекСтрока Из ТЗ Цикл
			//		ОбластьЛимитДЗ1.Параметры.Заполнить(ТекСтрока);
			//		ОбластьЛимитДЗ1.Параметры.Дата = Формат(ТекСтрока.Дата, "ДФ=dd.MM.yyyy");
			//		 
			//		ТабДок.Вывести(ОбластьЛимитДЗ1);		
			//		Если НачалоМесяца(Выборка.Дата) > ТекСтрока.Дата Тогда
			//			ТабДок.Вывести(ОбластьЛимитДЗ2);		
			//		Иначе
			//		КонецЕсли;
			//		ОбластьЛимитДЗ.Параметры.Заполнить(ТекСтрока);
			//		ТабДок.Вывести(ОбластьЛимитДЗ);
			//		
			//	    //Выводим реестр договоренностей
			//		ТЗ_Договоренностей = Выборка.ДоговоренностиКлиента.Выгрузить();
			//		СтруктураПоиска = Новый Структура("Контрагент", ТекСтрока.Контрагент);
			//		ОтобранныеСтр = ТЗ_Договоренностей.НайтиСтроки(СтруктураПоиска);
			//		Если ТЗ_Договоренностей.Количество() Тогда
			//			Для каждого ТекСТрокаДоговоренности Из ОтобранныеСтр Цикл
			//				ОбластьЛимитДЗ4.Параметры.Заполнить(ТекСТрокаДоговоренности);
			//				Если Не ЗначениеЗаполнено(ТекСТрокаДоговоренности.Предприятие) Тогда
			//					ОбластьЛимитДЗ4.Параметры.Предприятие = "<Все предприятия>";
			//				КонецЕсли;
			//				Если Не ЗначениеЗаполнено(ТекСТрокаДоговоренности.Номенклатура) Тогда
			//					ОбластьЛимитДЗ4.Параметры.Номенклатура = "<Вся номенклатура>";
			//				КонецЕсли;
			//				ТабДок.Вывести(ОбластьЛимитДЗ4);
			//			КонецЦикла; 
			//		Иначе	
			//			ОбластьЛимитДЗ4.Параметры.Заполнить(ТекСтрока);
			//			ТабДок.Вывести(ОбластьЛимитДЗ4);
			//		КонецЕсли;
			//		//конец вывода реестра договоренностей
			//		ОбластьЛимитДЗ3.Параметры.Заполнить(ТекСтрока);
			//		ОбластьЛимитДЗ3.Параметры.ТекЦенаУсловия = Формат(ТекСтрока.ТекЦена, "ЧДЦ=2; ЧН=0");
			//		ОбластьЛимитДЗ3.Параметры.ЦенаУсловия    = Формат(ТекСтрока.Цена,    "ЧДЦ=2; ЧН=0");
			//		ТабДок.Вывести(ОбластьЛимитДЗ3);
			//	КонецЦикла; 
			//КонецЕсли;
			
			Если Не ПустаяСтрока(Выборка.Текстовка) Тогда
				ОбластьТекстовка.Параметры.Текстовка = Выборка.Текстовка;
				ТабДок.Вывести(ОбластьТекстовка);		
			КонецЕсли;
			
			
		
		
			//показ этапов согласования СЗ/ознакомления
			
		КонецЕсли;
		
		БПСервер.ПоказатьРецензентов(ТабДок, Выборка.Ссылка, Неопределено, Ссылка, "Штампы", РецензентКомментарий, МассивОткрытыхИсторий, МассивОткрытыхИсторийАвтора);
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
КонецПроцедуры
